meeting/agenda/2024/05-07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 076 Agenda 2024-05-07</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 076 Agenda 2024-05-07</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT) 
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
<p>
NW gives regrets, MSM to chair.
</p>
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2024/04-30.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 7 May. The following meeting is scheduled for
14 May.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/7]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-071-06: NW to clarify the cases that are distinguished by the leading empty string in path segments</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-072-03: NW to clarify the round-tripping of URIs</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-073-01: NW to proceed with the records/options proposal and make a PR.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-075-01: MK to drop the deterministic option and raise it as a separate issue.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-075-02: MK to define sequence-concatenation more formally with links where appropriate</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-075-03: CG to make changes to <code>map:values</code> analagous to MK’s changes to <code>array:values</code></li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-956">#956</a>: 850-partial Editorial improvements to parse-html()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>: 77 Add map:deep-update and array:deep-update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528 fn:elements-to-maps</li>
</ul>
</div>
</div>

<div id="outline-container-xslt-focused" class="outline-4">
<h4 id="xslt-focused"><span class="section-number-4">1.6.2.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-xslt-focused">
<p>
The following PRs appear to be candidates for a future XSLT-focused
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1181">#1181</a>: 296 Allow default-namespace=##any</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1015">#1015</a>: 1013 [XSLT] Clarify effect of accumulator capture on non-element nodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-921">#921</a>: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-871">#871</a>: Action qt4 cg 027 01 next match</li>
</ul>

<p>
These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/168">#168</a>: XSLT Extension Instructions invoking Named Templates</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1186">#1186</a>: 1170 Editorial: fn:index-where</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1185">#1185</a>: 1179 array:values, map:values → contents</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1184">#1184</a>: 1165-Use Unicode-style character references</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1182">#1182</a>: 1171 Change predicate callbacks to allow empty return value</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1148">#1148</a>: 1143 Coercion rules: handle choice types before atomization</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1117">#1117</a>: 1116 Add options param to unparsed-text</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1108">#1108</a>: 566-partial Describe a less aggressive %-encoding for fn:build-uri</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1098">#1098</a>: 566-partial Editorial improvements for parse-uri</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1068">#1068</a>: 73 fn:graphemes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis - revised proposal for fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1027">#1027</a>: 150 fn:ranks</li>
</ul>
</div>
</div>

<div id="outline-container-proposed-40" class="outline-4">
<h4 id="proposed-40"><span class="section-number-4">1.6.4.</span> Proposed for V4.0</h4>
<div class="outline-text-4" id="text-proposed-40">
<p>
The following issues are labled “proposed for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1069">#1069</a>: fn:ucd</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/982">#982</a>: Add position argument to scan-left and scan-right</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/938">#938</a>: Canonical serialization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/934">#934</a>: String comparison in deep-equal</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/910">#910</a>: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/908">#908</a>: Function identity: documentation, nondeterminism</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/882">#882</a>: fn:chain or fn:compose</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/850">#850</a>: fn:parse-html: Finalization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/716">#716</a>: Generators in XPath</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: keep, drop, replace with $err:stack-trace ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/657">#657</a>: User-defined functions in main modules without `local` prefix</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/557">#557</a>: fn:unparsed-binary: accessing and manipulating binary types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/150">#150</a>: fn:ranks: Produce all ranks in applying a function on the items of a sequence</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/31">#31</a>: Extend FLWOR expressions to maps</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-1186" class="outline-3">
<h3 id="pr-1186"><span class="section-number-3">2.1.</span> PR #1186: 1170 Editorial: fn:index-where</h3>
<div class="outline-text-3" id="text-pr-1186">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-1186">PR #1186</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1185" class="outline-3">
<h3 id="pr-1185"><span class="section-number-3">2.2.</span> PR #1185: 1179 array:values, map:values → contents</h3>
<div class="outline-text-3" id="text-pr-1185">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-1185">PR #1185</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1184" class="outline-3">
<h3 id="pr-1184"><span class="section-number-3">2.3.</span> PR #1184: 1165-Use Unicode-style character references</h3>
<div class="outline-text-3" id="text-pr-1184">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-1184">PR #1184</a>.
</p>
</div>
</div>
<div id="outline-container-pr-1182" class="outline-3">
<h3 id="pr-1182"><span class="section-number-3">2.4.</span> PR #1182: 1171 Change predicate callbacks to allow empty return value</h3>
<div class="outline-text-3" id="text-pr-1182">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-1182">PR #1182</a>.
</p>
</div>
</div>

<div id="outline-container-pr-1148" class="outline-3">
<h3 id="pr-1148"><span class="section-number-3">2.5.</span> PR #1148: 1143 Coercion rules: handle choice types before atomization</h3>
<div class="outline-text-3" id="text-pr-1148">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1148">#1148</a>
</p>
</div>
</div>


<div id="outline-container-pr-1117" class="outline-3">
<h3 id="pr-1117"><span class="section-number-3">2.6.</span> PR #1117: 1116 Add options param to unparsed-text</h3>
<div class="outline-text-3" id="text-pr-1117">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1117">#1117</a>
</p>
</div>
</div>

<div id="outline-container-pr-1068" class="outline-3">
<h3 id="pr-1068"><span class="section-number-3">2.7.</span> PR #1068: 73 fn:graphemes</h3>
<div class="outline-text-3" id="text-pr-1068">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1068">#1068</a>
</p>
</div>
</div>

<div id="outline-container-pr-1062" class="outline-3">
<h3 id="pr-1062"><span class="section-number-3">2.8.</span> PR #1062/#1027: fn:ranks</h3>
<div class="outline-text-3" id="text-pr-1062">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>
See PR <a href="https://qt4cg.org/dashboard/#pr-1027">#1027</a>
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
